"""
लॅब ३ — type() फंक्शनचा वापर
==============================
"""

a = 25
b = 3.14
c = "नमस्कार"
d = True
e = [1, 2, 3]
f = (1, 2, 3)
g = {"naav": "राम"}
h = None

print(a, "->", type(a))
print(b, "->", type(b))
print(c, "->", type(c))
print(d, "->", type(d))
print(e, "->", type(e))
print(f, "->", type(f))
print(g, "->", type(g))
print(h, "->", type(h))


"""
========================================================
स्पष्टीकरण:
========================================================

type(x)  ->  x चा माहिती-प्रकार सांगते.
             output मध्ये <class 'int'> असे दिसते.

class म्हणजे काय?
   पायथनमध्ये प्रत्येक प्रकार ही एक 'class' (वर्ग) आहे.
   आपण नंतर class बद्दल विस्ताराने शिकू.

उपयोग:
   १. प्रोग्राम लिहिताना चूक शोधायला उपयोगी.
   २. कोणत्या चलात काय आहे ते तपासायला.
"""
