"""
लॅब २ — if-else
=================
"""

sankhya = 7

if sankhya % 2 == 0:
    print(sankhya, "ही सम संख्या आहे")
else:
    print(sankhya, "ही विषम संख्या आहे")


vay = 15
if vay >= 18:
    print("मतदार")
else:
    print("अद्याप मतदार नाहीस —", 18 - vay, "वर्षे थांब")


"""
========================================================
स्पष्टीकरण:
========================================================

%             ->  शिल्लक देणारा ऑपरेटर.
                  7 % 2 = 1 (विषम)
                  8 % 2 = 0 (सम)

== 0          ->  शून्य आहे का?

if अट:        ->  अट खरी असेल तर हा block
else:         ->  अट खोटी असेल तर हा block

else ला अट नाही — कारण ती "बाकी सर्व काही" आहे.
"""
